app/controllers/answers_controller.rb

  def create
    @answer = @question.answers.build(answer_params)
    respond_to do |format|
      if @answer.save
---
INSERT INTO "answers" ("content", "created_at", "question_id", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "sdfsdf"], ["created_at", "2014-12-10 19:46:46.720477"], ["question_id", 1], ["title", "sdfdsf"], ["updated_at", "2014-12-10 19:46:46.720477"]]

  def upvote
    @vote = @answer.votes.new(upvote: true)
    respond_to do |format|
      if @vote.save
---
INSERT INTO "votes" ("created_at", "updated_at", "upvote", "votable_id", "votable_type") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-12-10 21:14:55.061519"], ["updated_at", "2014-12-10 21:14:55.061519"], ["upvote", "t"], ["votable_id", 7], ["votable_type", "Answer"]]

  def downvote
    @vote = @answer.votes.create(upvote: false)
---
INSERT INTO "votes" ("created_at", "updated_at", "upvote", "votable_id", "votable_type") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-12-10 21:56:28.803129"], ["updated_at", "2014-12-10 21:56:28.803129"], ["upvote", "f"], ["votable_id", 1], ["votable_type", "Answer"]]

    def find_answer
      @answer = Answer.find_by(id: params[:id])
---
SELECT  "answers".* FROM "answers"  WHERE "answers"."id" = 7 LIMIT 1

    def find_question
      @question = Question.find_by(id: params[:question_id])
---
SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = 1 LIMIT 1