app/controllers/questions_controller.rb

INSERT INTO "questions" ("content", "created_at", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "ddhgfdhdhg"], ["created_at", "2014-12-10 19:00:29.762414"], ["title", "dfghdhghdh"], ["updated_at", "2014-12-10 19:00:29.762414"]]
---
  def create
    @question = Question.new(question_params)
      if @question.save

INSERT INTO "votes" ("created_at", "updated_at", "upvote", "votable_id", "votable_type") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-12-10 20:20:17.997602"], ["updated_at", "2014-12-10 20:20:17.997602"], ["upvote", "t"], ["votable_id", 5], ["votable_type", "Question"]]
---
  def upvote
    @question.votes.create(upvote: true)

INSERT INTO "votes" ("created_at", "updated_at", "upvote", "votable_id", "votable_type") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-12-10 20:20:16.173379"], ["updated_at", "2014-12-10 20:20:16.173379"], ["upvote", "f"], ["votable_id", 5], ["votable_type", "Question"]]
---
  def downvote
    @question.votes.create(upvote: false)

SELECT  "questions".* FROM "questions"  WHERE "questions"."id" IS NULL LIMIT 1
---
    def set_question
      @question = Question.find_by(id: params[:id])